app/controllers/albums_controller.rb

  def create
    @album = Album.new(params[:album])
    if @album.save
---
INSERT INTO `albums` (`name`, `updated_at`, `cover_photo_id`, `created_at`) VALUES('random', '2009-07-03 02:24:30', NULL, '2009-07-03 02:24:30')

  def update
    # Name is updated via AJAX.  The rest is updated via regular post
    if params[:album][:name]
      render :update do |page|
        if @album.update_attributes(params[:album])
---
UPDATE `albums` SET `updated_at` = '2009-07-03 17:09:57', `name` = 'toby and ian' WHERE `id` = 8

  def destroy
    @album.destroy
---
DELETE FROM `albums` WHERE `id` = 3

  def load_album
    @album = Album.find(params[:id])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 8)