app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.paginate(:per_page => 2, :page => params[:page] || 1, :order => 'created_at DESC')
---
SELECT * FROM `blogs` WHERE (created_at > '2009-06-01 00:00:00' AND created_at < '2009-06-30 23:59:59')
SELECT count(*) AS count_all FROM `blogs`

  def create
    @blog = Blog.new(params[:blog])
    if @blog.save
---
INSERT INTO `blogs` (`updated_at`, `title`, `content`, `created_at`) VALUES('2009-06-07 17:25:33', 'My New Blog', 'Hey how are you doing?', '2009-06-07 17:25:33')

  def update
    if @blog.update_attributes(params[:blog])
---
UPDATE `blogs` SET `content` = 'Hey how are you doing?\r\n\r\n#{img:Day_of_the_Dead__film__poster.jpg center}', `updated_at` = '2009-06-08 01:36:16' WHERE `id` = 1

  def destroy
    @blog.destroy
---
DELETE FROM `blogs` WHERE `id` = 3

  def search
    @by = params[:by]
    @value = params[:value]
    @blogs = case @by
     when 'tag': Blog.find_tagged_with(@value)
---
SELECT * FROM `blogs` WHERE (created_at > '2009-06-01 00:00:00' AND created_at < '2009-06-30 23:59:59')
SELECT tags.id, tags.name, COUNT(*) AS count FROM `tags` INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN blogs ON blogs.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Blog') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0

  def load_blog
    @blog = Blog.find(params[:id])
---
SELECT * FROM `blogs` WHERE (created_at > '2009-06-01 00:00:00' AND created_at < '2009-06-30 23:59:59')

  def load_search_photo_thumbs
    @blog_search_thumbs = BlogPhoto.all(:conditions => { :parent_id => nil }, :order => 'created_at DESC', :limit => 8)
---
SELECT * FROM `blog_photos` WHERE (`blog_photos`.`parent_id` IS NULL) ORDER BY created_at DESC LIMIT 8