app/controllers/blog_photos_controller.rb

DELETE FROM `blog_photos` WHERE `id` = 1
---
  def destroy
    @blog = @blog_photo.blog
    @blog_photo.destroy

SELECT * FROM `blog_photos` WHERE (`blog_photos`.parent_id = 1)
---
  def load_blog_photo
    @blog_photo = BlogPhoto.find(params[:id])