app/controllers/gallery_controller.rb

SELECT * FROM `albums` ORDER BY created_at DESC
---
  def index
    @albums = Album.all(:order => 'created_at DESC')