app/controllers/photos_controller.rb

  def update
    render :update do |page|
      if @photo.update_attributes(params[:photo])
---
UPDATE `photos` SET `description` = 'Me and Toby hurowr vrnhiwot[g 5hg brto hnfs opfs[ guirwgvur huirw tgtop gthui [pmbgidoh oifpowv gtioe hurowr vrnguirwgvur.', `updated_at` = '2009-07-03 20:28:10' WHERE `id` = 44

  def load_photo
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 44)